
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>2.2. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</title><link rel="stylesheet" href="/css/diveintopython.css" type="text/css" /><link rev="made" href="josh@servercobra.com" /><meta name="generator" content="DocBook XSL Stylesheets V" /><meta name="keywords" content="Python, язык Python, язык программирования Python, Dive Into Python, В глубь языка Python, учебник, объектно-ориентированный, программирование, документация, книга, free, свободный, бесплатный" /><meta name="description" content="a free Python book for experienced programmers" /><link rel="home" href="http://ru.diveintopython.net/" title="В глубь языка Python" /><link rel="up" href="http://ru.diveintopython.net/" title="Глава 2. Сила самоанализа" /><link rel="previous" href="http://ru.diveintopython.net/" title="Глава 2. Сила самоанализа" /><link rel="next" href="http://ru.diveintopython.net/" title="2.3. type, str, dir и другие встроенные функции" /><script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-9740779-18']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body>
<style type="text/css">body{margin-top:0!important;padding-top:0!important;min-width:800px!important;}#wm-ipp a:hover{text-decoration:underline!important;}</style>
<table id="Header" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td id="breadcrumb" colspan="5" align="left"><a href="http://ru.diveintopython.net/index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/toc.html">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/apihelper_divein.html">&#1057;&#1080;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;</a>&nbsp;&gt;&nbsp;<b>&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</b></td><td id="navigation" align="right">&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/apihelper_divein.html" title="Пред.: “Сила самоанализа”">&lt;&lt;</a>&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/apihelper_builtin.html" title="След.: “type, str, dir и другие встроенные функции”">&gt;&gt;</a></td></tr><tr><td><img src="http://ru.diveintopython.net/images/logo.png" alt="diveinto.python.ru" /></td><td colspan="2"><span id="logo">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</span><br /><span id="tagline">&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</span></td><td colspan="3" align="right"></td></tr></table><div class="section"><a name="apihelper.optional"></a><div class="titlepage"><div><h2 class="title"><a name="apihelper.optional"></a>2.2. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</h2></div></div><div class="abstract"><p>&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1086;&#1085;&#1086;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077;
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;.  &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1080;&#1084;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.  &#1042; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093;
&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1093; &#1076;&#1083;&#1103; SQL &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; Transact/SQL &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080; &#1076;&#1083;&#1103; SQL &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;, &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1083;&#1080;&#1096;&#1100; &#1073;&#1077;&#1075;&#1083;&#1086;
&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1084;.</p></div><div class="example"><p><a name="d0e1811"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2.4. <tt>help</tt> &#8212; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1089; &#1076;&#1074;&#1091;&#1084;&#1103; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;</b></p><pre class="programlisting"><span class="pykeyword">
def</span> help(object, spacing=10, collapse=1):</pre></div><p>&#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; <tt>spacing</tt> &#1080; <tt>collapse</tt> &#1084;&#1086;&#1075;&#1091;&#1090;
&#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1091;&#1097;&#1077;&#1085;&#1099; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1085;&#1080;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
&#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <tt>object</tt> &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;
&#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;.  &#1045;&#1089;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <tt>help</tt> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1090;&#1086; <tt>spacing</tt> &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;
<tt>10</tt> &#1080; <tt>collapse</tt> &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <tt>1</tt>.
&#1045;&#1089;&#1083;&#1080; <tt>help</tt> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1076;&#1074;&#1091;&#1084;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, <tt>collapse</tt> &#1090;&#1072;&#1082;&#1078;&#1077;
&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <tt>1</tt>.</p><p>&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;
<tt>collapse</tt>, &#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103;
<tt>spacing</tt>.  &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077;
&#1090;&#1088;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.  &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; Python &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1084;
&#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;.</p><div class="example"><p><a name="d0e1831"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2.5. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; <tt>help</tt></b></p><pre class="programlisting">
help(odbchelper)                    <a name="apihelper_args.1.1"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
help(odbchelper, 12)                <a name="apihelper_args.1.2"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" />
help(odbchelper, collapse=0)        <a name="apihelper_args.1.3"></a><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" />
help(spacing=15, object=odbchelper) <a name="apihelper_args.1.4"></a><img src="http://ru.diveintopython.net/images/callouts/4.png" alt="4" border="0" width="12" height="12" /></pre><div class="calloutlist"><a name="d0e1839"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_optional.html#apihelper_args.1.1"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1057; &#1086;&#1076;&#1085;&#1080;&#1084; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, <tt>spacing</tt> &#1080;
<tt>collapse</tt> &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;,
<tt>10</tt> &#1080; <tt>1</tt> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_optional.html#apihelper_args.1.2"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1057; &#1076;&#1074;&#1091;&#1084;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, <tt>collapse</tt> &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;
&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; <tt>1</tt>.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_optional.html#apihelper_args.1.3"><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1099; &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1080;&#1084;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, <tt>collapse</tt>, &#1076;&#1083;&#1103;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.  &#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <tt>spacing</tt>
&#1087;&#1086;-&#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; <tt>10</tt>.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_optional.html#apihelper_args.1.4"><img src="http://ru.diveintopython.net/images/callouts/4.png" alt="4" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1044;&#1072;&#1078;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; (&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#8212;
<tt>object</tt>), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1099; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1080; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1084;
&#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;.</td></tr></table></div></div><p>&#1069;&#1090;&#1086; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1082;&#1072; &#1074;&#1099; &#1085;&#1077; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1084;.  &#8220;&#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081;&#8221; &#1078;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1077;&#1079; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;&#1102;: &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;
&#1089;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;
&#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;.  &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1074;&#1099; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#8220;&#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084;&#8221; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;.</p><a name="tip.arguments"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042;&#1089;&#1077; &#1095;&#1090;&#1086; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#8212; &#1101;&#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.  &#1057;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1080;&#1093;
&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#8212; &#1076;&#1077;&#1083;&#1086; &#1042;&#1072;&#1096;&#1077;&#1075;&#1086; &#1074;&#1082;&#1091;&#1089;&#1072;.</td></tr></table><div class="furtherreading"><p><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072;</b></p><ul><li><a href="http://ru.diveintopython.net/doc/current/tut/tut.html"><i>Python Tutorial</i></a> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;, <a href="http://ru.diveintopython.net/doc/current/tut/node6.html#SECTION006710000000000000000">&#1082;&#1086;&#1075;&#1076;&#1072; &#1080; &#1082;&#1072;&#1082;
&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</a>. &#1069;&#1090;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084;, &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1084; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084;.</li></ul></div></div><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td width="35%" align="left"><br /><a href="http://ru.diveintopython.net/apihelper_divein.html"><span class="NavigationArrow">&lt;&lt;</span>&nbsp;&#1057;&#1080;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;</a></td><td width="30%" align="center"><br />&nbsp;<a href="http://ru.diveintopython.net/apihelper_divein.html#apihelper.divein" title="2.1. В глубь">1</a> <b>2</b> <a href="http://ru.diveintopython.net/apihelper_builtin.html" title="2.3. type, str, dir и другие встроенные функции">3</a> <a href="http://ru.diveintopython.net/apihelper_getattr.html" title="2.4. Получение атрибутов с помощью getattr">4</a> <a href="http://ru.diveintopython.net/apihelper_filter.html" title="2.5. Фильтрование списков">5</a> <a href="http://ru.diveintopython.net/apihelper_andor.html" title="2.6. Особенности операторов and и or">6</a> <a href="http://ru.diveintopython.net/apihelper_lambda.html" title="2.7. Использование lambda-функций">7</a> <a href="http://ru.diveintopython.net/apihelper_alltogether.html" title="2.8. Объединяем все вместе">8</a> <a href="http://ru.diveintopython.net/apihelper_summary.html" title="2.9. Заключение">9</a>&nbsp;</td><td width="35%" align="right"><br /><a href="http://ru.diveintopython.net/apihelper_builtin.html">type, str, dir &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;&nbsp;<span class="NavigationArrow">&gt;&gt;</span></a></td></tr><tr><td colspan="3"><br /></td></tr></table><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td align="left"><p class="copyright">Copyright &copy; 2000, 2001, 2002 <a href="mailto:josh@servercobra.com">&#1052;&#1072;&#1088;&#1082; &#1055;&#1080;&#1083;&#1075;&#1088;&#1080;&#1084;</a></p><p class="copyright">Copyright &copy; 2001, 2002, 2003 &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, <a href="mailto:josh@servercobra.com">&#1044;&#1077;&#1085;&#1080;&#1089; &#1054;&#1090;&#1082;&#1080;&#1076;&#1072;&#1095;</a></p></td><td align="left">&nbsp;</td></tr></table></body></html>
