
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>2.5. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</title><link rel="stylesheet" href="/css/diveintopython.css" type="text/css" /><link rev="made" href="josh@servercobra.com" /><meta name="generator" content="DocBook XSL Stylesheets V" /><meta name="keywords" content="Python, язык Python, язык программирования Python, Dive Into Python, В глубь языка Python, учебник, объектно-ориентированный, программирование, документация, книга, free, свободный, бесплатный" /><meta name="description" content="a free Python book for experienced programmers" /><link rel="home" href="http://ru.diveintopython.net/" title="В глубь языка Python" /><link rel="up" href="http://ru.diveintopython.net/" title="Глава 2. Сила самоанализа" /><link rel="previous" href="http://ru.diveintopython.net/" title="2.4. Получение атрибутов с помощью getattr" /><link rel="next" href="http://ru.diveintopython.net/" title="2.6. Особенности операторов and и or" /><script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-9740779-18']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body>
<style type="text/css">body{margin-top:0!important;padding-top:0!important;min-width:800px!important;}#wm-ipp a:hover{text-decoration:underline!important;}</style>
<table id="Header" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td id="breadcrumb" colspan="5" align="left"><a href="http://ru.diveintopython.net/index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/toc.html">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/apihelper_divein.html">&#1057;&#1080;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;</a>&nbsp;&gt;&nbsp;<b>&#1060;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</b></td><td id="navigation" align="right">&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/apihelper_getattr.html" title="Пред.: “Получение атрибутов с помощью getattr”">&lt;&lt;</a>&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/apihelper_andor.html" title="След.: “Особенности операторов and и or”">&gt;&gt;</a></td></tr><tr><td><img src="http://ru.diveintopython.net/images/logo.png" alt="diveinto.python.ru" /></td><td colspan="2"><span id="logo">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</span><br /><span id="tagline">&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</span></td><td colspan="3" align="right"></td></tr></table><div class="section"><a name="apihelper.filter"></a><div class="titlepage"><div><h2 class="title"><a name="apihelper.filter"></a>2.5. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</h2></div></div><div class="abstract"><p>&#1050;&#1072;&#1082; &#1074;&#1099; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, Python &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;.  &#1058;&#1072;&#1082;&#1086;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072;
&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103;.</p></div><div class="example"><p><a name="d0e2247"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2.13. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</b></p><pre class="programlisting">
[<i><tt>mapping-expression</tt></i><span class="pykeyword"> for</span> <i><tt>element</tt></i><span class="pykeyword"> in</span> <i><tt>source-list</tt></i><span class="pykeyword"> if</span> <i><tt>filter-expression</tt></i>]</pre></div><p>&#1069;&#1090;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; <a href="http://ru.diveintopython.net/odbchelper_map.html" title="1.13. Обработка списков">&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</a>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099;
&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1083;&#1102;&#1073;&#1080;&#1090;&#1077;.  &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1078;&#1085;&#1080;&#1084;, &#1072; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077;,
&#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; <tt>if</tt>, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;
&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.  &#1059;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1084; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1080;&#1085;&#1091; &#1080;&#1083;&#1080;
&#1083;&#1086;&#1078;&#1100; (&#1074; Python &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; <a href="http://ru.diveintopython.net/odbchelper_list.html#tip.boolean">&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1083;&#1102;&#1073;&#1099;&#1084;
&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;</a>).  &#1051;&#1102;&#1073;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1080;&#1085;&#1091;, &#1073;&#1091;&#1076;&#1077;&#1090;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080;.  &#1042;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;
&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103;.</p><div class="example"><p><a name="d0e2259"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2.14. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</b></p><pre class="screen"><tt>&gt;&gt;&gt; </tt><span class="userinput">li = [<span class="pystring">"a"</span>, <span class="pystring">"mpilgrim"</span>, <span class="pystring">"foo"</span>, <span class="pystring">"b"</span>, <span class="pystring">"c"</span>, <span class="pystring">"b"</span>, <span class="pystring">"d"</span>, <span class="pystring">"d"</span>]</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">[elem <span class="pykeyword">for</span> elem <span class="pykeyword">in</span> li <span class="pykeyword">if</span> len(elem) &gt; 1]</span>       <a name="apihelper.filter.1.1"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
<span class="computeroutput">['mpilgrim', 'foo']</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">[elem <span class="pykeyword">for</span> elem <span class="pykeyword">in</span> li <span class="pykeyword">if</span> elem != <span class="pystring">"b"</span>]</span>         <a name="apihelper.filter.1.2"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" />
<span class="computeroutput">['a', 'mpilgrim', 'foo', 'c', 'd', 'd']</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">[elem <span class="pykeyword">for</span> elem <span class="pykeyword">in</span> li <span class="pykeyword">if</span> li.count(elem) == 1]</span> <a name="apihelper.filter.1.3"></a><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" />
<span class="computeroutput">['a', 'mpilgrim', 'foo', 'c']</span></pre><div class="calloutlist"><a name="d0e2276"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_filter.html#apihelper.filter.1.1"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;), &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1089;&#1086;&#1089;&#1088;&#1077;&#1076;&#1086;&#1090;&#1086;&#1095;&#1100;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;.  &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;
&#1087;&#1088;&#1086;&#1073;&#1077;&#1075;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; Python &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;.  &#1045;&#1089;&#1083;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;
&#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1080;&#1085;&#1091;, &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;.  &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1099; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081; &#1074; &#1086;&#1076;&#1080;&#1085;
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_filter.html#apihelper.filter.1.2"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1047;&#1076;&#1077;&#1089;&#1100; &#1084;&#1099; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;,
<tt>"b"</tt>.  &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1084; &#1086;&#1090;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; <tt>"b"</tt>, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
&#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1083;&#1086;&#1078;&#1100;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/apihelper_filter.html#apihelper.filter.1.3"><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>count</tt> &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;.  &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;
&#1074;&#1089;&#1077; &#1076;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1090;&#1099;, &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102;
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;.  &#1053;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1077; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099; (&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1101;&#1090;&#1086;, <tt>"b"</tt> and
<tt>"d"</tt>) &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103;.  &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1076;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1090;&#1099; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;.</td></tr></table></div></div><div class="example"><p><a name="apihelper.filter.care"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2.15. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074; <tt>apihelper.py</tt></b></p><pre class="programlisting">
    methodList = [method <span class="pykeyword">for</span> method <span class="pykeyword">in</span> dir(object) <span class="pykeyword">if</span> callable(getattr(object, method))]</pre></div><p>&#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1081;.
&#1042;&#1089;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;
<tt>methodList</tt>.  &#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077;: &#1086;&#1085;&#1086; &#1076;&#1072;&#1077;&#1090;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;.  &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;
<tt></tt><tt>dir</tt>(<tt>object</tt>) &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093;
&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <tt>object</tt> &#8212; &#1101;&#1090;&#1086; &#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1099; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1084;.  &#1048; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1085;&#1086;&#1074;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#8212; &#1101;&#1090;&#1086; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;
&#1087;&#1086;&#1089;&#1083;&#1077; <tt>if</tt>.</p><p>&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1078;&#1091;&#1090;&#1082;&#1086;, &#1085;&#1086; &#1086;&#1085; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;.  &#1042;&#1099; &#1091;&#1078;&#1077;
&#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1086; <a href="http://ru.diveintopython.net/apihelper_builtin.html#apihelper.builtin.callable" title="Пример 2.9. Функция callable"><tt>callable</tt></a>, <a href="http://ru.diveintopython.net/apihelper_getattr.html#apihelper.getattr.intro" title="Пример 2.11. Функция getattr"><tt>getattr</tt></a> &#1080; <a href="http://ru.diveintopython.net/odbchelper_tuple.html#odbchelper.tuplemethods" title="Пример 1.23. У кортежей нет методов"><tt>in</tt></a>.  &#1050;&#1072;&#1082; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1074; <a href="http://ru.diveintopython.net/apihelper_getattr.html" title="2.4. Получение атрибутов с помощью getattr">&#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;</a>, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
<tt>getattr(object, method)</tt> &#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080;
<tt>object</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; &#1080; <tt>method</tt> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;
&#1080;&#1084;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;.</p><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1084;&#1099; &#1073;&#1077;&#1088;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <tt>object</tt>, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
&#1080;&#1084;&#1077;&#1085; &#1077;&#1075;&#1086; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1091;&#1077;&#1084; &#1101;&#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1080;&#1079;&#1073;&#1072;&#1074;&#1083;&#1103;&#1103;&#1089;&#1100;
&#1086;&#1090; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1089; &#1085;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;.  &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1086;&#1075;&#1086;, &#1084;&#1099;
&#1073;&#1077;&#1088;&#1077;&#1084; &#1080;&#1084;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;/&#1084;&#1077;&#1090;&#1086;&#1076;&#1072;/&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <tt>getattr</tt> &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084;
&#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.  &#1047;&#1072;&#1090;&#1077;&#1084; &#1084;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1084;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1084;
&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1086;&#1076;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1103; &#1074;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#8212; &#1082;&#1072;&#1082; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
&#1084;&#1077;&#1090;&#1086;&#1076; <tt>pop</tt> &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;), &#1090;&#1072;&#1082; &#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;
<tt>buildConnectionString</tt> &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <tt>odbchelper</tt>).  &#1053;&#1072;&#1089; &#1085;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1090;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <tt>__name__</tt>.</p><div class="furtherreading"><p><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072;</b></p><ul><li><a href="http://ru.diveintopython.net/doc/current/tut/tut.html"><i>Python Tutorial</i></a> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;
<a href="http://ru.diveintopython.net/doc/current/tut/node7.html#SECTION007130000000000000000">&#1089;
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;
<tt>filter</tt></a>.</li></ul></div></div><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td width="35%" align="left"><br /><a href="http://ru.diveintopython.net/apihelper_getattr.html"><span class="NavigationArrow">&lt;&lt;</span>&nbsp;&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; getattr</a></td><td width="30%" align="center"><br />&nbsp;<a href="http://ru.diveintopython.net/apihelper_divein.html#apihelper.divein" title="2.1. В глубь">1</a> <a href="http://ru.diveintopython.net/apihelper_optional.html" title="2.2. Необязательные и именованные аргументы">2</a> <a href="http://ru.diveintopython.net/apihelper_builtin.html" title="2.3. type, str, dir и другие встроенные функции">3</a> <a href="http://ru.diveintopython.net/apihelper_getattr.html" title="2.4. Получение атрибутов с помощью getattr">4</a> <b>5</b> <a href="http://ru.diveintopython.net/apihelper_andor.html" title="2.6. Особенности операторов and и or">6</a> <a href="http://ru.diveintopython.net/apihelper_lambda.html" title="2.7. Использование lambda-функций">7</a> <a href="http://ru.diveintopython.net/apihelper_alltogether.html" title="2.8. Объединяем все вместе">8</a> <a href="http://ru.diveintopython.net/apihelper_summary.html" title="2.9. Заключение">9</a>&nbsp;</td><td width="35%" align="right"><br /><a href="http://ru.diveintopython.net/apihelper_andor.html">&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; and &#1080; or&nbsp;<span class="NavigationArrow">&gt;&gt;</span></a></td></tr><tr><td colspan="3"><br /></td></tr></table><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td align="left"><p class="copyright">Copyright &copy; 2000, 2001, 2002 <a href="mailto:josh@servercobra.com">&#1052;&#1072;&#1088;&#1082; &#1055;&#1080;&#1083;&#1075;&#1088;&#1080;&#1084;</a></p><p class="copyright">Copyright &copy; 2001, 2002, 2003 &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, <a href="mailto:josh@servercobra.com">&#1044;&#1077;&#1085;&#1080;&#1089; &#1054;&#1090;&#1082;&#1080;&#1076;&#1072;&#1095;</a></p></td><td align="left">&nbsp;</td></tr></table></body></html>
