
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>1.2. &#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;</title><link rel="stylesheet" href="/css/diveintopython.css" type="text/css" /><link rev="made" href="josh@servercobra.com" /><meta name="generator" content="DocBook XSL Stylesheets V" /><meta name="keywords" content="Python, язык Python, язык программирования Python, Dive Into Python, В глубь языка Python, учебник, объектно-ориентированный, программирование, документация, книга, free, свободный, бесплатный" /><meta name="description" content="a free Python book for experienced programmers" /><link rel="home" href="http://ru.diveintopython.net/" title="В глубь языка Python" /><link rel="up" href="http://ru.diveintopython.net/" title="Глава 1. Знакомство с языком Python" /><link rel="previous" href="http://ru.diveintopython.net/" title="Глава 1. Знакомство с языком Python" /><link rel="next" href="http://ru.diveintopython.net/" title="1.3. Документирование функций" /><script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-9740779-18']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body>
<style type="text/css">body{margin-top:0!important;padding-top:0!important;min-width:800px!important;}#wm-ipp a:hover{text-decoration:underline!important;}</style>
<table id="Header" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td id="breadcrumb" colspan="5" align="left"><a href="http://ru.diveintopython.net/index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/toc.html">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_divein.html">&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; &#1103;&#1079;&#1099;&#1082;&#1086;&#1084; Python</a>&nbsp;&gt;&nbsp;<b>&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;</b></td><td id="navigation" align="right">&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_divein.html" title="Пред.: “Знакомство с языком Python”">&lt;&lt;</a>&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_docstring.html" title="След.: “Документирование функций”">&gt;&gt;</a></td></tr><tr><td><img src="http://ru.diveintopython.net/images/logo.png" alt="diveinto.python.ru" /></td><td colspan="2"><span id="logo">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</span><br /><span id="tagline">&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</span></td><td colspan="3" align="right"></td></tr></table><div class="section"><a name="odbchelper.funcdef"></a><div class="titlepage"><div><h2 class="title"><a name="odbchelper.funcdef"></a>1.2. &#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;</h2></div></div><div class="abstract"><p>&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python, &#1082;&#1072;&#1082; &#1080; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1077;&#1089;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1085;&#1086; &#1074; &#1085;&#1077;&#1084; &#1085;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1074; C++, &#1080;&#1083;&#1080;
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;/&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1072;&#1082; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; Pascal.  &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;
&#8212; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1077;&#1077;.</p></div><div class="example"><p><a name="d0e167"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1.3. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <tt>buildConnectionString</tt></b></p><pre class="programlisting"><span class="pykeyword">
def</span> buildConnectionString(params):</pre></div><p>&#1047;&#1076;&#1077;&#1089;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1081;.  &#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; <tt>def</tt>, &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1080;&#1084;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;
&#1080;, &#1074; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093;, &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;.  &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;,
&#1077;&#1089;&#1083;&#1080; &#1078;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1086;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
&#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102;.</p><p>&#1042;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1074;&#1099; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1077; &#1090;&#1080;&#1087; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;.  &#1042; &#1103;&#1079;&#1099;&#1082;&#1077;
Python &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1080;&#1087; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1076;&#1072;&#1078;&#1077;
&#1077;&#1075;&#1086; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;; &#1077;&#1089;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; <tt>return</tt>, &#1086;&#1085;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074; &#1085;&#1077;&#1081; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;, &#1080;&#1085;&#1072;&#1095;&#1077;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#8212; <tt>None</tt>.</p><a name="compare.funcdef.vb"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Visual Basic &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; (&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1097;&#1080;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;
&#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; <tt>function</tt>, &#1072; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; (&#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1097;&#1080;&#1093;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#8212; &#1089; <tt>sub</tt>.  &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1085;&#1077;&#1090; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;.
&#1058;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;, &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081;. &#1051;&#1102;&#1073;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; <tt>None</tt>, &#1080;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; <tt>def</tt>.</td></tr></table><p>&#1042; &#1090;&#1088;&#1077;&#1090;&#1100;&#1080;&#1093;, &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1090;&#1080;&#1087; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <tt>params</tt>.  &#1042; &#1103;&#1079;&#1099;&#1082;&#1077;
Python &#1090;&#1080;&#1087; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1103;&#1074;&#1085;&#1086;.  Python &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1080;&#1087;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</p><a name="compare.funcdef.java"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042; Java, C++ &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093; &#1089;&#1086; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;.  &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1074;&#1099;
&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1090;&#1080;&#1087;.  &#1058;&#1080;&#1087; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1077;
&#1077;&#1081; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.</td></tr></table><p><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;.&nbsp;</b>&#1069;&#1088;&#1091;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1100; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1083; &#1084;&#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1097;&#1077;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103;
Python &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:</p><div class="variablelist"><dl><dt><a name="d0e211"></a><span class="term">&#1071;&#1079;&#1099;&#1082; &#1089;&#1086; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;</span></dt><dd>&#1071;&#1079;&#1099;&#1082;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1080;&#1087; (&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;) &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; Java &#1080;&#1083;&#1080; C.</dd><dt><a name="d0e218"></a><span class="term">&#1071;&#1079;&#1099;&#1082; &#1089; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;</span></dt><dd>&#1071;&#1079;&#1099;&#1082;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1080;&#1087; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;.
VBScript &#1080; Python &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084;&#1080; &#1089; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1090;&#1080;&#1087; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1077;&#1081; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.</dd><dt><a name="d0e224"></a><span class="term">&#1071;&#1079;&#1099;&#1082; &#1089;&#1086; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;</span></dt><dd>&#1071;&#1079;&#1099;&#1082;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1080;&#1087; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1095;&#1077;&#1090;&#1082;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; Java &#1080;&#1083;&#1080;
Python.  &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1094;&#1077;&#1083;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1073;&#1099;&#1090;&#1100; &#1074;&#1072;&#1084;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1086; &#1074;
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1073;&#1077;&#1079; &#1103;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1084;&#1099; &#1086;&#1087;&#1080;&#1096;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;
&#1085;&#1080;&#1078;&#1077;).</dd><dt><a name="d0e230"></a><span class="term">&#1071;&#1079;&#1099;&#1082; &#1089;&#1086; &#1089;&#1083;&#1072;&#1073;&#1086;&#1081; &#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;</span></dt><dd>&#1071;&#1079;&#1099;&#1082;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1086;&#1084; &#1090;&#1080;&#1087;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;.  &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;
VBScript &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; <tt>'12'</tt> &#1089; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;
<tt>3</tt> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; <tt>'123'</tt>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102;
&#1079;&#1072;&#1090;&#1077;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; <tt>123</tt>, &#1080; &#1074;&#1089;&#1077;
&#1101;&#1090;&#1086; &#1073;&#1077;&#1079; &#1103;&#1074;&#1085;&#1099;&#1093; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;.</dd></dl></div><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; Python &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1103;&#1079;&#1099;&#1082;&#1086;&#1084; &#1089;&#1086; <span class="emphasis"><i>&#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1081;</i></span>
(&#1090;&#1080;&#1087; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) <span class="emphasis"><i>&#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;</i></span> (&#1085;&#1077;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1080;&#1087;&#1072;) <span class="emphasis"><i>&#1090;&#1080;&#1087;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;</i></span>.</p></div><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td width="35%" align="left"><br /><a href="http://ru.diveintopython.net/odbchelper_divein.html"><span class="NavigationArrow">&lt;&lt;</span>&nbsp;&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; &#1103;&#1079;&#1099;&#1082;&#1086;&#1084; Python</a></td><td width="30%" align="center"><br />&nbsp;<a href="http://ru.diveintopython.net/odbchelper_divein.html#odbchelper.divein" title="1.1. В глубь">1</a> <b>2</b> <a href="http://ru.diveintopython.net/odbchelper_docstring.html" title="1.3. Документирование функций">3</a> <a href="http://ru.diveintopython.net/odbchelper_objects.html" title="1.4. Все является объектами">4</a> <a href="http://ru.diveintopython.net/odbchelper_indenting.html" title="1.5. Отступы">5</a> <a href="http://ru.diveintopython.net/odbchelper_testing.html" title="1.6. Тестирование модулей">6</a> <a href="http://ru.diveintopython.net/odbchelper_dict.html" title="1.7. Словари">7</a> <a href="http://ru.diveintopython.net/odbchelper_list.html" title="1.8. Списки">8</a> <a href="http://ru.diveintopython.net/odbchelper_tuple.html" title="1.9. Кортежи">9</a> <a href="http://ru.diveintopython.net/odbchelper_vardef.html" title="1.10. Определение переменных">10</a> <a href="http://ru.diveintopython.net/odbchelper_multiassign.html" title="1.11. Присваивание сразу нескольких значений">11</a> <a href="http://ru.diveintopython.net/odbchelper_stringformatting.html" title="1.12. Форматированное представление">12</a> <a href="http://ru.diveintopython.net/odbchelper_map.html" title="1.13. Обработка списков">13</a> <a href="http://ru.diveintopython.net/odbchelper_join.html" title="1.14. Объединение и разбиение строк">14</a> <a href="http://ru.diveintopython.net/odbchelper_summary.html" title="1.15. Заключение">15</a>&nbsp;</td><td width="35%" align="right"><br /><a href="http://ru.diveintopython.net/odbchelper_docstring.html">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;&nbsp;<span class="NavigationArrow">&gt;&gt;</span></a></td></tr><tr><td colspan="3"><br /></td></tr></table><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td align="left"><p class="copyright">Copyright &copy; 2000, 2001, 2002 <a href="mailto:josh@servercobra.com">&#1052;&#1072;&#1088;&#1082; &#1055;&#1080;&#1083;&#1075;&#1088;&#1080;&#1084;</a></p><p class="copyright">Copyright &copy; 2001, 2002, 2003 &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, <a href="mailto:josh@servercobra.com">&#1044;&#1077;&#1085;&#1080;&#1089; &#1054;&#1090;&#1082;&#1080;&#1076;&#1072;&#1095;</a></p></td><td align="left">&nbsp;</td></tr></table></body></html>
