
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>3.3. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;</title><link rel="stylesheet" href="/css/diveintopython.css" type="text/css" /><link rev="made" href="josh@servercobra.com" /><meta name="generator" content="DocBook XSL Stylesheets V" /><meta name="keywords" content="Python, язык Python, язык программирования Python, Dive Into Python, В глубь языка Python, учебник, объектно-ориентированный, программирование, документация, книга, free, свободный, бесплатный" /><meta name="description" content="a free Python book for experienced programmers" /><link rel="home" href="http://ru.diveintopython.net/" title="В глубь языка Python" /><link rel="up" href="http://ru.diveintopython.net/" title="Глава 3. Средства объектно-ориентированного программирования" /><link rel="previous" href="http://ru.diveintopython.net/" title="3.2. Импортирование модулей инструкцией from module import" /><link rel="next" href="http://ru.diveintopython.net/" title="3.4. Создание экземпляров классов" /><script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-9740779-18']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body>
<style type="text/css">body{margin-top:0!important;padding-top:0!important;min-width:800px!important;}#wm-ipp a:hover{text-decoration:underline!important;}</style>
<table id="Header" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td id="breadcrumb" colspan="5" align="left"><a href="http://ru.diveintopython.net/index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/toc.html">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/fileinfo_divein.html">&#1057;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a>&nbsp;&gt;&nbsp;<b>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;</b></td><td id="navigation" align="right">&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/fileinfo_fromimport.html" title="Пред.: “Импортирование модулей инструкцией from module import”">&lt;&lt;</a>&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/fileinfo_instantiation.html" title="След.: “Создание экземпляров классов”">&gt;&gt;</a></td></tr><tr><td><img src="http://ru.diveintopython.net/images/logo.png" alt="diveinto.python.ru" /></td><td colspan="2"><span id="logo">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</span><br /><span id="tagline">&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</span></td><td colspan="3" align="right"></td></tr></table><div class="section"><a name="fileinfo.class"></a><div class="titlepage"><div><h2 class="title"><a name="fileinfo.class"></a>3.3. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;</h2></div></div><div class="abstract"><p>Python &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1094;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: &#1074;&#1099; &#1073;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;
&#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1072;&#1084;&#1080;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.</p></div><p>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;.  &#1050;&#1072;&#1082; &#1080; &#1076;&#1083;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1076;&#1083;&#1103;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;.  &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077;
Python &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; <tt>class</tt> &#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1079;&#1072; &#1085;&#1080;&#1084;
&#1080;&#1084;&#1077;&#1085;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.  &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1101;&#1090;&#1086; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084;
&#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1084; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.</p><div class="example"><p><a name="fileinfo.class.simplest"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3.5. &#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;</b></p><pre class="programlisting"><span class="pykeyword">
class</span> foo: <a name="fileinfo.class.1.1"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
    <span class="pykeyword">pass</span>   <a name="fileinfo.class.1.2"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /> <a name="fileinfo.class.1.3"></a><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></pre><div class="calloutlist"><a name="d0e3123"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.1.1"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <tt>foo</tt>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1084; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.1.2"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1069;&#1090;&#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;, &#1085;&#1086; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;
&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1093;&#1086;&#1090;&#1103;&#1073;&#1099; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;
<tt>pass</tt>.  &#1069;&#1090;&#1086; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;
&#1085;&#1091;&#1078;&#1085;&#1086;.  &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; <tt>pass</tt> &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1080; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1085;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1103; &#1074;
&#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1075;&#1083;&#1091;&#1096;&#1082;&#1091; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.1.3"><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1050;&#1072;&#1082; &#1074;&#1099;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;, &#1091;&#1078;&#1077; &#1076;&#1086;&#1075;&#1072;&#1076;&#1072;&#1083;&#1080;&#1089;&#1100;, &#1090;&#1077;&#1083;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1086;&#1084;,
&#1082;&#1072;&#1082; &#1080; &#1090;&#1077;&#1083;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081; <tt>if</tt>, <tt>for</tt> &#1080; &#1090;. &#1076;.  &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;,
&#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1072;&#1103; &#1073;&#1077;&#1079; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1072;, &#1091;&#1078;&#1077; &#1085;&#1077; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.</td></tr></table></div></div><a name="compare.pass.java"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; <tt>pass</tt> &#1074; Python &#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084; &#1092;&#1080;&#1075;&#1091;&#1088;&#1085;&#1099;&#1084;
&#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1084; (<tt>{}</tt>) &#1074; Java &#1080; C.</td></tr></table><p>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1086;&#1090;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;.  &#1053;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1099;
&#1091;&#1078;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1083;&#1080;, &#1085;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080;.  &#1042;
&#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;&#1084; &#1085;&#1072; C++ &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077;
Python &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1103;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1080; &#1076;&#1077;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;.  &#1042; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072; Python
&#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1095;&#1090;&#1086;? &#1087;&#1086;&#1093;&#1086;&#1078;&#1077;&#1077; &#1085;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#8212; &#1084;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt>.</p><div class="example"><p><a name="fileinfo.class.example"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3.6. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt>FileInfo</tt></b></p><pre class="programlisting"><span class="pykeyword">
from</span> UserDict <span class="pykeyword">import</span> UserDict

<span class="pykeyword">class</span><span class="pyclass"> FileInfo</span>(UserDict): <a name="fileinfo.class.2.1"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></pre><div class="calloutlist"><a name="d0e3160"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.1"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093; &#1089;&#1088;&#1072;&#1079;&#1091;
&#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.  &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089; <tt>FileInfo</tt>
&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt>UserDict</tt> (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099;&#1083; <a href="http://ru.diveintopython.net/fileinfo_fromimport.html" title="3.2. Импортирование модулей инструкцией from module import">&#1087;&#1088;&#1086;&#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <tt>UserDict</tt></a>).
<tt>UserDict</tt> &#8212; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1102;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1103; &#1086;&#1090; &#1085;&#1077;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1083;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;.
(&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <tt>UserList</tt> &#1080;
<tt>UserString</tt>, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081; &#1086;&#1090;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.)  &#1047;&#1076;&#1077;&#1089;&#1100; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1085;&#1086;&#1081; &#1084;&#1072;&#1075;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1088;&#1072;&#1089;&#1082;&#1088;&#1086;&#1077;&#1084; &#1087;&#1086;&#1079;&#1078;&#1077; &#1074;
&#1101;&#1090;&#1086;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1084; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;
<tt>UserDict</tt>.</td></tr></table></div></div><a name="compare.extends.java"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;
&#1080;&#1084;&#1077;&#1085;&#1080;.  &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;, &#1090;&#1072;&#1082;&#1086;&#1077; &#1082;&#1072;&#1082;
<tt>extends</tt> &#1074; Java.</td></tr></table><a name="tip.multipleinheritance"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1061;&#1086;&#1090;&#1103; &#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091; &#1073;&#1091;&#1076;&#1091; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;, Python &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;
&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.  &#1042; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100;
&#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;.</td></tr></table><div class="example"><p><a name="fileinfo.init.example"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3.7. &#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt>FileInfo</tt></b></p><pre class="programlisting"><span class="pykeyword">
class</span> FileInfo(UserDict):
    <span class="pystring">"&#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1084;&#1077;&#1090;&#1072;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1092;&#1072;&#1081;&#1083;&#1077;"</span>    <a name="fileinfo.class.2.2"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
    <span class="pykeyword">def</span><span class="pyclass"> __init__</span>(self, filename=None): <a name="fileinfo.class.2.3"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /> <a name="fileinfo.class.2.4"></a><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /> <a name="fileinfo.class.2.5"></a><img src="http://ru.diveintopython.net/images/callouts/4.png" alt="4" border="0" width="12" height="12" /></pre><div class="calloutlist"><a name="d0e3194"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.2"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1044;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; (&#1080; <a href="http://ru.diveintopython.net/odbchelper_docstring.html#tip.docstring">&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;</a>)
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.3"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.
&#1057;&#1086;&#1073;&#1083;&#1072;&#1079;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1086; &#1085;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084;.
&#1057;&#1086;&#1073;&#1083;&#1072;&#1079;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1082;&#1072;&#1082; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; (&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; <tt>__init__</tt>
&#1073;&#1099;&#1083; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077;), &#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; &#1082;&#1072;&#1082; &#1082;&#1086;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; (&#1101;&#1090;&#1086;
&#1087;&#1077;&#1088;&#1099;&#1081; &#1082;&#1091;&#1089;&#1086;&#1082; &#1082;&#1086;&#1076;&#1072;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;) &#1080; &#1076;&#1072;&#1078;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1082;&#1072;&#1082; &#1082;&#1086;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;.  &#1053;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082; &#1090;&#1086;&#1084;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;
<tt>__init__</tt>, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1091;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1080; &#1074;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1053;&#1086;
&#1084;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt> &#8212; &#1101;&#1090;&#1086; &#1089;&#1072;&#1084;&#1086;&#1077; &#1073;&#1083;&#1080;&#1079;&#1082;&#1086;&#1077; &#1082; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1091;, &#1080;&#1079; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077;
Python.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.4"><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1055;&#1077;&#1088;&#1074;&#1099;&#1084; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; <tt>__init__</tt>, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.  &#1054;&#1073;&#1097;&#1077;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <tt>self</tt>.  &#1042;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <tt>__init__</tt> <tt>self</tt> &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1093; &#8212; &#1085;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.  &#1061;&#1086;&#1090;&#1103; &#1080;
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; <tt>self</tt> &#1087;&#1088;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1074;&#1099; &#1077;&#1075;&#1086;
<span class="emphasis"><i>&#1085;&#1077;</i></span> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;; Python &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090; &#1077;&#1075;&#1086;
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.5"><img src="http://ru.diveintopython.net/images/callouts/4.png" alt="4" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt> &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1095;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1080;&#1093; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;.  &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <tt>filename</tt> &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; <tt>None</tt>.</td></tr></table></div></div><a name="compare.self.java"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (&#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;) &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; <tt>self</tt>.  &#1069;&#1090;&#1086;&#1090; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080;&#1075;&#1088;&#1072;&#1077;&#1090; &#1088;&#1086;&#1083;&#1100; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; <tt>this</tt> &#1074;
C++ &#1080; Java, &#1085;&#1086; <tt>self</tt> &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; &#8212; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;.  &#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1101;&#1090;&#1086;, &#1085;&#1077; &#1089;&#1090;&#1086;&#1080;&#1090; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080;&#1085;&#1072;&#1095;&#1077;, &#1095;&#1077;&#1084; <tt>self</tt>.</td></tr></table><div class="example"><p><a name="fileinfo.init.code.example"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3.8. &#1058;&#1077;&#1083;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt>FileInfo</tt></b></p><pre class="programlisting"><span class="pykeyword">
class</span> FileInfo(UserDict):
    <span class="pystring">"&#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1084;&#1077;&#1090;&#1072;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1092;&#1072;&#1081;&#1083;&#1077;"</span>   
    <span class="pykeyword">def</span><span class="pyclass"> __init__</span>(self, filename=None):
        UserDict.__init__(self)        <a name="fileinfo.class.2.6"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
        self[<span class="pystring">"name"</span>] = filename        <a name="fileinfo.class.2.7"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" />
                                       <a name="fileinfo.class.2.8"></a><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></pre><div class="calloutlist"><a name="d0e3241"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.6"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;
Powerbuilder, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#8220;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;&#8221;
&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;: &#1084;&#1077;&#1090;&#1086;&#1076; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.  &#1042;
Python &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1103;&#1074;&#1085;&#1086; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1086;&#1084;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1077;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.7"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1071; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1096; &#1082;&#1083;&#1072;&#1089;&#1089; &#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1102;, &#1080; &#1074;&#1086;&#1090; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077;
&#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;: &#1084;&#1099; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;
<tt>filename</tt> &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;
<tt>name</tt>.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/fileinfo_class.html#fileinfo.class.2.8"><img src="http://ru.diveintopython.net/images/callouts/3.png" alt="3" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt> &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.</td></tr></table></div></div><a name="tip.whenself"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <span class="emphasis"><i>&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;</i></span> &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;
<tt>self</tt> &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; <tt>__init__</tt>.  &#1055;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; <span class="emphasis"><i>&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;</i></span> &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; <tt>self</tt> &#1074;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.  &#1053;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1080;&#1079;&#1074;&#1085;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <tt>self</tt> &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;,
&#1072; &#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.  &#1055;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1101;&#1090;&#1086;
&#1089;&#1073;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089; &#1090;&#1086;&#1083;&#1082;&#1091; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1074;&#1099; &#1077;&#1097;&#1077; &#1085;&#1077; &#1091;&#1079;&#1085;&#1072;&#1083;&#1080;
&#1086; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1099; &#1080; &#1085;&#1077;&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080;.</td></tr></table><p>&#1042;&#1086;&#1090; &#1090;&#1072;&#1082;.  &#1055;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1085;&#1086; &#1074;&#1099; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;
&#1085;&#1072;&#1083;&#1086;&#1074;&#1095;&#1080;&#1090;&#1077;&#1089;&#1100;.  &#1042;&#1089;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1080;&#1079;&#1091;&#1095;&#1080;&#1074;
&#1086;&#1076;&#1080;&#1085;, &#1074;&#1099; &#1091;&#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093;.  &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1084; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;, &#1085;&#1086; &#1086;&#1076;&#1085;&#1086;
&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1089;&#1090;&#1086;&#1080;&#1090; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; (&#1080;&#1085;&#1072;&#1095;&#1077;, &#1086;&#1073;&#1077;&#1097;&#1072;&#1102;, &#1074;&#1099; &#1082;&#1086;&#1075;&#1076;&#1072;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1079;&#1072;&#1087;&#1091;&#1090;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100;):</p><a name="tip.initoptional"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>__init__</tt> &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1077;&#1075;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1077;, &#1090;&#1086; &#1085;&#1077;
&#1079;&#1072;&#1073;&#1091;&#1076;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <tt>__init__</tt> &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.  &#1069;&#1090;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1074;&#1077;&#1088;&#1085;&#1086; &#1080; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1096;&#1080;&#1088;&#1086;&#1082;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077;: &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1093;&#1086;&#1095;&#1077;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086;, &#1090;&#1086;
&#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089;
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1077;&#1084;&#1091; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;.</td></tr></table><div class="furtherreading"><p><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072;</b></p><ul><li>&#1042; <a href="http://ru.diveintopython.net/~agauld/"><i>Learning to Program</i></a> &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1085;&#1086;&#1077; <a href="http://ru.diveintopython.net/~agauld/tutclass.htm">&#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;</a>.</li><li><a href="http://ru.diveintopython.net/obp/thinkCSpy/"><i>How to Think Like a Computer Scientist</i></a> &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1082;&#1072;&#1082; <a href="http://ru.diveintopython.net/obp/thinkCSpy/chap11.htm">&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093;
&#1090;&#1080;&#1087;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</a>.</li><li>&#1042; <a href="http://ru.diveintopython.net/doc/current/tut/tut.html"><i>Python Tutorial</i></a> &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; <a href="http://ru.diveintopython.net/doc/current/tut/node11.html">&#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074; &#1080;&#1084;&#1077;&#1085; &#1080;
&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a>.</li><li><a href="http://ru.diveintopython.net/knowledge-base/index.phtml/fid/199/">Python Knowledge Base</a> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072; <a href="http://ru.diveintopython.net/knowledge-base/index.phtml/fid/242">&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1093;</a>.</li></ul></div></div><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td width="35%" align="left"><br /><a href="http://ru.diveintopython.net/fileinfo_fromimport.html"><span class="NavigationArrow">&lt;&lt;</span>&nbsp;&#1048;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1077;&#1081; from module import</a></td><td width="30%" align="center"><br />&nbsp;<a href="http://ru.diveintopython.net/fileinfo_divein.html#fileinfo.divein" title="3.1. В глубь">1</a> <a href="http://ru.diveintopython.net/fileinfo_fromimport.html" title="3.2. Импортирование модулей инструкцией from module import">2</a> <b>3</b> <a href="http://ru.diveintopython.net/fileinfo_instantiation.html" title="3.4. Создание экземпляров классов">4</a> <a href="http://ru.diveintopython.net/fileinfo_userdict.html" title="3.5. UserDict: a wrapper class">5</a> <a href="http://ru.diveintopython.net/fileinfo_specialmethods.html" title="3.6. Special class methods">6</a> <a href="http://ru.diveintopython.net/fileinfo_morespecial.html" title="3.7. Advanced special class methods">7</a> <a href="http://ru.diveintopython.net/fileinfo_classattributes.html" title="3.8. Class attributes">8</a> <a href="http://ru.diveintopython.net/fileinfo_private.html" title="3.9. Private functions">9</a> <a href="http://ru.diveintopython.net/fileinfo_exception.html" title="3.10. Handling exceptions">10</a> <a href="http://ru.diveintopython.net/fileinfo_files.html" title="3.11. File objects">11</a> <a href="http://ru.diveintopython.net/fileinfo_for.html" title="3.12. for loops">12</a> <a href="http://ru.diveintopython.net/fileinfo_modules.html" title="3.13. More on modules">13</a> <a href="http://ru.diveintopython.net/fileinfo_os.html" title="3.14. The os module">14</a> <a href="http://ru.diveintopython.net/fileinfo_alltogether.html" title="3.15. Putting it all together">15</a> <a href="http://ru.diveintopython.net/fileinfo_summary.html" title="3.16. Summary">16</a>&nbsp;</td><td width="35%" align="right"><br /><a href="http://ru.diveintopython.net/fileinfo_instantiation.html">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;&nbsp;<span class="NavigationArrow">&gt;&gt;</span></a></td></tr><tr><td colspan="3"><br /></td></tr></table><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td align="left"><p class="copyright">Copyright &copy; 2000, 2001, 2002 <a href="mailto:josh@servercobra.com">&#1052;&#1072;&#1088;&#1082; &#1055;&#1080;&#1083;&#1075;&#1088;&#1080;&#1084;</a></p><p class="copyright">Copyright &copy; 2001, 2002, 2003 &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, <a href="mailto:josh@servercobra.com">&#1044;&#1077;&#1085;&#1080;&#1089; &#1054;&#1090;&#1082;&#1080;&#1076;&#1072;&#1095;</a></p></td><td align="left">&nbsp;</td></tr></table></body></html>
