
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>1.14. &#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;</title><link rel="stylesheet" href="/css/diveintopython.css" type="text/css" /><link rev="made" href="josh@servercobra.com" /><meta name="generator" content="DocBook XSL Stylesheets V" /><meta name="keywords" content="Python, язык Python, язык программирования Python, Dive Into Python, В глубь языка Python, учебник, объектно-ориентированный, программирование, документация, книга, free, свободный, бесплатный" /><meta name="description" content="a free Python book for experienced programmers" /><link rel="home" href="http://ru.diveintopython.net/" title="В глубь языка Python" /><link rel="up" href="http://ru.diveintopython.net/" title="Глава 1. Знакомство с языком Python" /><link rel="previous" href="http://ru.diveintopython.net/" title="1.13. Обработка списков" /><link rel="next" href="http://ru.diveintopython.net/" title="1.15. Заключение" /><script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-9740779-18']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script></head><body>
<style type="text/css">body{margin-top:0!important;padding-top:0!important;min-width:800px!important;}#wm-ipp a:hover{text-decoration:underline!important;}</style>
<table id="Header" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td id="breadcrumb" colspan="5" align="left"><a href="http://ru.diveintopython.net/index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/toc.html">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</a>&nbsp;&gt;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_divein.html">&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; &#1103;&#1079;&#1099;&#1082;&#1086;&#1084; Python</a>&nbsp;&gt;&nbsp;<b>&#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;</b></td><td id="navigation" align="right">&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_map.html" title="Пред.: “Обработка списков”">&lt;&lt;</a>&nbsp;&nbsp;&nbsp;<a href="http://ru.diveintopython.net/odbchelper_summary.html" title="След.: “Заключение”">&gt;&gt;</a></td></tr><tr><td><img src="http://ru.diveintopython.net/images/logo.png" alt="diveinto.python.ru" /></td><td colspan="2"><span id="logo">&#1042; &#1075;&#1083;&#1091;&#1073;&#1100; &#1103;&#1079;&#1099;&#1082;&#1072; Python</span><br /><span id="tagline">&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;</span></td><td colspan="3" align="right"></td></tr></table><div class="section"><a name="odbchelper.join"></a><div class="titlepage"><div><h2 class="title"><a name="odbchelper.join"></a>1.14. &#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;</h2></div></div><div class="abstract"><p>&#1042;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090;&#1077; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1080;&#1076;&#1072;
<tt><i>key</i>=<i>value</i></tt>
&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;.  &#1044;&#1083;&#1103; &#1101;&#1090;&#1080;&#1093; &#1094;&#1077;&#1083;&#1077;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <tt>join</tt> &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.</p></div><div class="example"><p><a name="d0e1557"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1.34. &#1054;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082; &#1074; <tt>buildConnectionString</tt></b></p><pre class="programlisting">
    <span class="pykeyword">return</span> <span class="pystring">";"</span>.join([<span class="pystring">"%s=%s"</span> % (k, v) <span class="pykeyword">for</span> k, v <span class="pykeyword">in</span> params.items()])</pre></div><p>&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1084;&#1099; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1084;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1102; &#1086;&#1076;&#1085;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;.  &#1071;
&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;, &#1095;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;, &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;,
&#1074;&#1089;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;.  &#1042;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1076; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;
&#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1077; <span class="emphasis"><i>&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;</i></span>.  &#1053;&#1086; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;
&#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; <tt>";"</tt>
&#1089;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1084;&#1077;&#1090;&#1086;&#1076; <tt>join</tt> &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1099; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077;.</p><p>&#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1084;&#1077;&#1090;&#1086;&#1076; <tt>join</tt> &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1074;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1089; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;.  &#1057;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077;
&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; &#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1072;&#1083;&#1072; &#1090;&#1086;&#1095;&#1082;&#1072; &#1089; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;, &#1085;&#1077;
&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085; &#1073;&#1099;&#1083; &#1086;&#1076;&#1085;&#1080;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &#8212; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081;.</p><a name="tip.join"></a><table class="important" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/important.png" alt="Важно" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>join</tt> &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1086;&#1085; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;
&#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;.  &#1045;&#1089;&#1083;&#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1076;&#1080;&#1085; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077;&#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;.</td></tr></table><div class="example"><p><a name="d0e1572"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1.35. &#1042;&#1099;&#1074;&#1086;&#1076; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; <tt>odbchelper.py</tt></b></p><pre class="screen"><tt>&gt;&gt;&gt; </tt><span class="userinput">params = {<span class="pystring">"server"</span>:<span class="pystring">"mpilgrim"</span>, <span class="pystring">"database"</span>:<span class="pystring">"master"</span>, <span class="pystring">"uid"</span>:<span class="pystring">"sa"</span>, <span class="pystring">"pwd"</span>:<span class="pystring">"secret"</span>}</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">[<span class="pystring">"%s=%s"</span> % (k, v) <span class="pykeyword">for</span> k, v <span class="pykeyword">in</span> params.items()]</span>
<span class="computeroutput">['server=mpilgrim', 'uid=sa', 'database=master', 'pwd=secret']</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput"><span class="pystring">";"</span>.join([<span class="pystring">"%s=%s"</span> % (k, v) <span class="pykeyword">for</span> k, v <span class="pykeyword">in</span> params.items()])</span>
<span class="computeroutput">server=mpilgrim;uid=sa;database=master;pwd=secret</span></pre></div><p>&#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <tt>buildConnectionString</tt> &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;.</p><p><b>&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;.&nbsp;</b>&#1050;&#1086;&#1075;&#1076;&#1072; &#1103; &#1085;&#1072;&#1095;&#1072;&#1083; &#1080;&#1079;&#1091;&#1095;&#1072;&#1090;&#1100; Python, &#1103; &#1086;&#1078;&#1080;&#1076;&#1072;&#1083;, &#1095;&#1090;&#1086; <tt>join</tt> &#1073;&#1091;&#1076;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;-&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#8212; &#1077;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;.  &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1076;&#1091;&#1084;&#1072;&#1083;&#1080; &#1090;&#1086;&#1095;&#1085;&#1086;
&#1090;&#1072;&#1082;&#1078;&#1077;.  &#1044;&#1086; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Python 1.6 &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1085;&#1077; &#1080;&#1084;&#1077;&#1083;&#1080; &#1074;&#1089;&#1077;&#1093; &#1101;&#1090;&#1080;&#1093; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;.  &#1041;&#1099;&#1083; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; <tt>string</tt>, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080;.  &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086;&#1089;&#1095;&#1080;&#1090;&#1072;&#1083;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1076;&#1083;&#1103; &#1090;&#1072;&#1082;&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1082;&#1072;&#1082;
<tt>lower</tt>, <tt>upper</tt> &#1080;
<tt>split</tt>.  &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1083;&#1080; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072;
&#1085;&#1086;&#1074;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <tt>join</tt>, &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1089;&#1090;&#1072;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <tt>string</tt> (&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1080; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1074;&#1077;&#1097;&#1077;&#1081;).  &#1057;&#1072;&#1084; &#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102; &#1085;&#1086;&#1074;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <tt>join</tt>, &#1085;&#1086; &#1074;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1082;&#1086;&#1076; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080; &#1087;&#1086;-&#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091;.  &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1074;&#1072;&#1089; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077;&#1075;&#1086; &#1089;&#1090;&#1072;&#1088;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;
<tt>string.join</tt>.</p><p>&#1042;&#1099;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;, &#1079;&#1072;&#1076;&#1072;&#1076;&#1080;&#1090;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1077;&#1089;&#1090;&#1100; &#1083;&#1080; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1103;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1082;?  &#1044;&#1072;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1085;
<tt>split</tt>.</p><div class="example"><p><a name="odbchelper.split.example"></a><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1.36. &#1056;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;</b></p><pre class="screen"><tt>&gt;&gt;&gt; </tt><span class="userinput">li = [<span class="pystring">'server=mpilgrim'</span>, <span class="pystring">'uid=sa'</span>, <span class="pystring">'database=master'</span>, <span class="pystring">'pwd=secret'</span>]</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">s = <span class="pystring">";"</span>.join(li)</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">s</span>
<span class="computeroutput">'server=mpilgrim;uid=sa;database=master;pwd=secret'</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">s.split(<span class="pystring">";"</span>)</span>    <a name="odbchelper.join.1.1"></a><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" />
<span class="computeroutput">['server=mpilgrim', 'uid=sa', 'database=master', 'pwd=secret']</span>
<tt>&gt;&gt;&gt; </tt><span class="userinput">s.split(<span class="pystring">";"</span>, 1)</span> <a name="odbchelper.join.1.2"></a><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" />
<span class="computeroutput">['server=mpilgrim', 'uid=sa;database=master;pwd=secret']</span></pre><div class="calloutlist"><a name="d0e1620"></a><table border="0" summary="Callout list"><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/odbchelper_join.html#odbchelper.join.1.1"><img src="http://ru.diveintopython.net/images/callouts/1.png" alt="1" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>split</tt> &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <tt>join</tt>, &#1088;&#1072;&#1079;&#1073;&#1080;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;
&#1085;&#1072; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.  &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1072;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;
(&#8220;<tt>;</tt>&#8221;) &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077;.</td></tr><tr><td width="12" valign="top" align="left"><a href="http://ru.diveintopython.net/odbchelper_join.html#odbchelper.join.1.2"><img src="http://ru.diveintopython.net/images/callouts/2.png" alt="2" border="0" width="12" height="12" /></a> </td><td valign="top" align="left">&#1052;&#1077;&#1090;&#1086;&#1076; <tt>split</tt> &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;
&#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1081;.  (&#8220;&#1054;-&#1086;-&#1086;, &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;&#8230;&#8221;  &#1042;&#1099; &#1091;&#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1089; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;.)</td></tr></table></div></div><a name="tip.split"></a><table class="note" border="0"><tr><td rowspan="2" align="center" valign="top" width="24"><img src="http://ru.diveintopython.net/images/note.png" alt="Замечание" width="24" height="24" /></td></tr><tr><td colspan="2" align="left" valign="top">&#1042;&#1099;&#1079;&#1086;&#1074;
<tt><i>anystring</i>.</tt><tt>split</tt>(<i>delimiter</i>,
1) &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1077;&#1085;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;
&#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;, &#1079;&#1072;&#1090;&#1077;&#1084;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1076;&#1086; &#1101;&#1090;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1086;&#1082;&#1080; (&#1086;&#1085; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;) &#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1075;&#1086; (&#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;).</td></tr></table><div class="furtherreading"><p><b>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072;</b></p><ul><li><a href="http://ru.diveintopython.net/knowledge-base/index.phtml/fid/199/">Python Knowledge Base</a> &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1085;&#1072; <a href="http://ru.diveintopython.net/knowledge-base/index.phtml/fid/480">&#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1093;</a> &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; <a href="http://ru.diveintopython.net/knowledge-base/index.phtml/fid/539">&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1072; &#1089;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</a>.</li><li><a href="http://ru.diveintopython.net/doc/current/lib/"><i>Python Library Reference</i></a> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; <a href="http://ru.diveintopython.net/doc/current/lib/string-methods.html">&#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;
&#1089;&#1090;&#1088;&#1086;&#1082;</a>.</li><li><a href="http://ru.diveintopython.net/doc/current/lib/"><i>Python Library Reference</i></a> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; <a href="http://ru.diveintopython.net/doc/current/lib/module-string.html">&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;
<tt>string</tt></a>.</li><li><a href="http://ru.diveintopython.net/doc/FAQ.html"><i>The Whole Python FAQ</i></a> &#1086;&#1073;&#1098;&#1103;&#1085;&#1103;&#1077;&#1090;, <a href="http://ru.diveintopython.net/cgi-bin/faqw.py?query=4.96&amp;querytype=simple&amp;casefold=yes&amp;req=search">&#1087;&#1086;&#1095;&#1077;&#1084;&#1091;
<tt>join</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a>, &#1072; &#1085;&#1077;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;.</li></ul></div></div><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td width="35%" align="left"><br /><a href="http://ru.diveintopython.net/odbchelper_map.html"><span class="NavigationArrow">&lt;&lt;</span>&nbsp;&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;</a></td><td width="30%" align="center"><br />&nbsp;<a href="http://ru.diveintopython.net/odbchelper_divein.html#odbchelper.divein" title="1.1. В глубь">1</a> <a href="http://ru.diveintopython.net/odbchelper_funcdef.html" title="1.2. Объявление функций">2</a> <a href="http://ru.diveintopython.net/odbchelper_docstring.html" title="1.3. Документирование функций">3</a> <a href="http://ru.diveintopython.net/odbchelper_objects.html" title="1.4. Все является объектами">4</a> <a href="http://ru.diveintopython.net/odbchelper_indenting.html" title="1.5. Отступы">5</a> <a href="http://ru.diveintopython.net/odbchelper_testing.html" title="1.6. Тестирование модулей">6</a> <a href="http://ru.diveintopython.net/odbchelper_dict.html" title="1.7. Словари">7</a> <a href="http://ru.diveintopython.net/odbchelper_list.html" title="1.8. Списки">8</a> <a href="http://ru.diveintopython.net/odbchelper_tuple.html" title="1.9. Кортежи">9</a> <a href="http://ru.diveintopython.net/odbchelper_vardef.html" title="1.10. Определение переменных">10</a> <a href="http://ru.diveintopython.net/odbchelper_multiassign.html" title="1.11. Присваивание сразу нескольких значений">11</a> <a href="http://ru.diveintopython.net/odbchelper_stringformatting.html" title="1.12. Форматированное представление">12</a> <a href="http://ru.diveintopython.net/odbchelper_map.html" title="1.13. Обработка списков">13</a> <b>14</b> <a href="http://ru.diveintopython.net/odbchelper_summary.html" title="1.15. Заключение">15</a>&nbsp;</td><td width="35%" align="right"><br /><a href="http://ru.diveintopython.net/odbchelper_summary.html">&#1047;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&nbsp;<span class="NavigationArrow">&gt;&gt;</span></a></td></tr><tr><td colspan="3"><br /></td></tr></table><table class="Footer" width="100%" border="0" cellpadding="0" cellspacing="0"><tr><td align="left"><p class="copyright">Copyright &copy; 2000, 2001, 2002 <a href="mailto:josh@servercobra.com">&#1052;&#1072;&#1088;&#1082; &#1055;&#1080;&#1083;&#1075;&#1088;&#1080;&#1084;</a></p><p class="copyright">Copyright &copy; 2001, 2002, 2003 &#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, <a href="mailto:josh@servercobra.com">&#1044;&#1077;&#1085;&#1080;&#1089; &#1054;&#1090;&#1082;&#1080;&#1076;&#1072;&#1095;</a></p></td><td align="left">&nbsp;</td></tr></table></body></html>
